{
  "ok": true,
  "count": 5,
  "accountsWithPosts": 5,
  "fetchedAt": "2026-02-19T04:00:47.754715+00:00",
  "windowHours": 4,
  "curation": "guaranteed3_engagement2",
  "errors": [],
  "posts": [
    {
      "id": "2024328118752653650",
      "text": "down to 100 billionaires now",
      "author": "zerohedge",
      "handle": "zerohedge",
      "createdAt": "2026-02-19T03:40:08+00:00",
      "createdAtMs": 1771472408000,
      "likes": 0,
      "retweets": 0,
      "url": "https://x.com/zerohedge/status/2024328118752653650#m",
      "avatar": null,
      "slot": "guaranteed",
      "slot_order": 1
    },
    {
      "id": "2024328113379750318",
      "text": "The country has cannot produce the chips on which AI depends. But it does have attributes that could help shape how the technology is adopted https://www.economist.com/asia/2026/02/17/the-flaws-in-indias-ai-plans",
      "author": "TheEconomist",
      "handle": "TheEconomist",
      "createdAt": "2026-02-19T03:40:07+00:00",
      "createdAtMs": 1771472407000,
      "likes": 0,
      "retweets": 0,
      "url": "https://x.com/TheEconomist/status/2024328113379750318#m",
      "avatar": null,
      "slot": "guaranteed",
      "slot_order": 2
    },
    {
      "id": "2024291265114747205",
      "text": "Foreign enrollment at US colleges is falling:\n\nInternational student enrollment at US universities declined -1.4% YoY this fall, the first decrease in 3 years.\n\n~5,000 fewer international students enrolled nationwide.\n\nThe decline was led by graduate enrollment programs that plunged -6%, by ~10,000 students, the most in at least 5 years.\n\nThis follows an increase of +50% between 2020 and 2024.\n\nPublic 4-year institutions were hit hardest, recording a -9% drop in graduate international students.\n\nForeign student inflow is slowing.",
      "author": "KobeissiLetter",
      "handle": "KobeissiLetter",
      "createdAt": "2026-02-19T01:13:41+00:00",
      "createdAtMs": 1771463621000,
      "likes": 0,
      "retweets": 0,
      "url": "https://x.com/KobeissiLetter/status/2024291265114747205#m",
      "avatar": null,
      "slot": "guaranteed",
      "slot_order": 3
    },
    {
      "id": "2024047124477104541",
      "text": "🚨 Physicists have achieved the impossible by transforming graphene into a quantum fluid that behaves like a frictionless liquid, defying a century of established science.\n\nIn a breakthrough that challenges 100 years of physics, researchers have observed electrons in graphene behaving like a \"perfect quantum liquid.\" At a specific state known as the Dirac point, the material stops acting like a traditional conductor or insulator. Instead of moving as individual particles, the electrons flow collectively like water, but with a viscosity so low it rivals the quark-gluon plasma found in the early universe or at the heart of particle colliders. This collective motion allows for properties previously thought impossible in solid-state materials, turning a single sheet of carbon atoms into a laboratory for high-energy physics.\n\nThe most startling discovery was the complete breakdown of the Wiedemann–Franz law, which traditionally dictates that heat and electricity must flow together in metals. In this quantum fluid, researchers observed a violation 200 times greater than any previous measurement, as heat and charge effectively went their separate ways. Beyond its theoretical implications for understanding black holes and quantum entanglement, this ultra-responsive behavior could pave the way for a new generation of hyper-sensitive sensors. These devices could soon be capable of detecting the faintest electrical and magnetic signals with unprecedented precision.\n\nSource: Crossno, J., Shi, J. K., Wang, K., Mannix, S. A., Rarey, A., & Kim, P. (2016). Observation of the Dirac fluid and the breakdown of the Wiedemann-Franz law in graphene. Science.",
      "author": "BambroughKevin",
      "handle": "BambroughKevin",
      "createdAt": "2026-02-18T09:03:34+00:00",
      "createdAtMs": 1771405414000,
      "likes": 0,
      "retweets": 0,
      "url": "https://x.com/NextScience/status/2024047124477104541#m",
      "avatar": null,
      "slot": "engagement",
      "slot_order": 4
    },
    {
      "id": "2024249192864993541",
      "text": "Pretty much👇👇\n\nRather own MDI CN and let these idiots overpay for drilling services. Sleep well at night with similar index torque…",
      "author": "hkuppy",
      "handle": "hkuppy",
      "createdAt": "2026-02-18T22:26:30+00:00",
      "createdAtMs": 1771453590000,
      "likes": 0,
      "retweets": 0,
      "url": "https://x.com/hkuppy/status/2024249192864993541#m",
      "avatar": null,
      "slot": "engagement",
      "slot_order": 5
    }
  ]
}