{
  "ok": true,
  "count": 4,
  "accountsWithPosts": 4,
  "fetchedAt": "2026-02-27T20:58:12.782327+00:00",
  "windowHours": 4,
  "curation": "guaranteed3_engagement1",
  "errors": [],
  "posts": [
    {
      "id": "2027486330075128103",
      "text": "TRUMP TELLS ALL AGENCIES TO STOP USE OF ANTHROPIC’S TECHNOLOGY\n\nhello down valuation round",
      "author": "zerohedge",
      "handle": "zerohedge",
      "createdAt": "2026-02-27T20:49:44+00:00",
      "createdAtMs": 1772225384000,
      "likes": 0,
      "retweets": 0,
      "url": "https://x.com/zerohedge/status/2027486330075128103#m",
      "avatar": null,
      "slot": "guaranteed",
      "slot_order": 1
    },
    {
      "id": "2027483893109002420",
      "text": "The Trump administration’s squeeze on the regime is making life harder than ever for Cubans. Blackouts, already measured in hours, stretch longer. Yet things are not as bad as they might be, thanks to solar energy https://www.economist.com/the-americas/2026/02/26/donald-trumps-oil-embargo-reveals-a-solar-boom-in-cuba",
      "author": "TheEconomist",
      "handle": "TheEconomist",
      "createdAt": "2026-02-27T20:40:03+00:00",
      "createdAtMs": 1772224803000,
      "likes": 0,
      "retweets": 0,
      "url": "https://x.com/TheEconomist/status/2027483893109002420#m",
      "avatar": null,
      "slot": "guaranteed",
      "slot_order": 2
    },
    {
      "id": "2027485389196308604",
      "text": "Retail investors are buying Nvidia at a record pace:\n\nIndividual investors bought ~$360 million of Nvidia, $NVDA, shares in the first 80 minutes of Thursday’s trading session, the most for any session opening on record.\n\nBy comparison, the daily average over the prior 5 trading sessions was ~$94 million.\n\nThis comes after Nvidia crushed its Q4 earnings expectations and issued strong guidance for Q1.\n\nNvidia has been a top stock for retail investors since 2023, according to Vanda Research data.\n\nDespite the strong results and retail buying, $NVDA stock ended the session -5.5% lower.\n\nRetail investors are still buying Nvidia.",
      "author": "KobeissiLetter",
      "handle": "KobeissiLetter",
      "createdAt": "2026-02-27T20:46:00+00:00",
      "createdAtMs": 1772225160000,
      "likes": 0,
      "retweets": 0,
      "url": "https://x.com/KobeissiLetter/status/2027485389196308604#m",
      "avatar": null,
      "slot": "guaranteed",
      "slot_order": 3
    },
    {
      "id": "2027411624668123379",
      "text": "Chatting with a good friend this morning and top trader.  We were speculating on how unprecedented the stock chart and vol will be for $hg $hgraf cause it’s such an unprecedented story. \n\nI gave the same example of how I hear of people that got in early selling to take profits simply because it’s gone up so much and they expect the opportunity to buy in later on a dip.  \n\nBut when you query them about valuation they don’t have a clue how potentially cheap the stock is .. with some pro brokers telling me ‘if they get 5000 tonnes of orders it will be $50bln company”. \n\nAlong with this constant struggle of people taking profits and hoping to get back in… the stock will keep shifting to new hands. Stronger hands… that are buying at $6-7 cause they think it’s going to $50 or $100.  \n\nMeanwhile undoubtedly there will be hedge funds and speculators trying to short it.  Huge fuel to surge the stock as the achieve milestone. Partnerships, orders, more patents. Etc  \n\nFinally. Next to no institutional ownership and no index funds yet.  Both will come.  \n\nUnprecedented moves ahead.  Know what you own or get left behind. \n\nEric Sprott taught me to have these convos daily with yourself. Reminding me why I own it a where I think it’s going.  \n\nIt’s so difficult to get a 100x return.  We just keep are eye on the prize and understand the significance of it each press release and data point from interviews so we can make the best risk reward decisions",
      "author": "BambroughKevin",
      "handle": "BambroughKevin",
      "createdAt": "2026-02-27T15:52:53+00:00",
      "createdAtMs": 1772207573000,
      "likes": 0,
      "retweets": 0,
      "url": "https://x.com/BambroughKevin/status/2027411624668123379#m",
      "avatar": null,
      "slot": "engagement",
      "slot_order": 4
    }
  ]
}